[
  {
    "version": "1.0.51",
    "date": "2026-02-22",
    "notes": "VPN page peer tables now collapse by default. Click the card header to expand/collapse Tailscale or NetBird peer lists. Peer counts remain visible in the header at all times."
  },
  {
    "version": "1.0.50",
    "date": "2026-02-22",
    "notes": "Added self-registration with access request workflow. New users register via 'Request Access' on the login page, enter a pending state, and see a holding screen until approved. Admins see pending requests in Users page with approve/deny/role controls, and a banner on the dashboard when requests are waiting."
  },
  {
    "version": "1.0.49",
    "date": "2026-02-22",
    "notes": "Map page now fills full available height with no blank space. README rewritten: NetBird as primary VPN, Tailscale references minimized, irrelevant content removed, feeder beast_out requirement documented."
  },
  {
    "version": "1.0.48",
    "date": "2026-02-21",
    "notes": "Login logo centered correctly. Services page: added Restart All Services (soft reset) button that restarts all TAKNET containers with a live status modal."
  },
  {
    "version": "1.0.47",
    "date": "2026-02-21",
    "notes": "Login page logo updated to oval TAKNET-PS badge, displayed at 80% screen width."
  },
  {
    "version": "1.0.46",
    "date": "2026-02-21",
    "notes": "Fixed web update — git clone and file copy now run inside docker:cli container which has the host install directory bind-mounted, ensuring files actually land on disk. Also added 1s delay before restart to ensure pre_restart event reaches the browser."
  },
  {
    "version": "1.0.45",
    "date": "2026-02-21",
    "notes": "Login page restyled to match dashboard dark theme. TAKNET-PS logo added as splash above login fields."
  },
  {
    "version": "1.0.44",
    "date": "2026-02-21",
    "notes": "Fixed updates page showing stale 'update available' after web update completes. Version status now refreshes automatically after the modal closes."
  },
  {
    "version": "1.0.43",
    "date": "2026-02-21",
    "notes": "Removed LAT/LONG from tar1090 config. Combined with v1.0.41-42 fixes, aggregator now displays aircraft from feeders at any location without range filtering at any layer."
  },
  {
    "version": "1.0.42",
    "date": "2026-02-21",
    "notes": "Removed fixed READSB_LAT/LON from readsb config. With READSB_NET_RECEIVER_ID enabled, readsb uses each feeder's own position for CPR decoding, fixing position loss for remote feeders."
  },
  {
    "version": "1.0.41",
    "date": "2026-02-21",
    "notes": "Removed READSB_MAX_RANGE limit. Aggregator now accepts aircraft data from feeders at any distance, enabling nationwide and international deployments."
  },
  {
    "version": "1.0.40",
    "date": "2026-02-21",
    "notes": "About page now accessible to all authenticated users (admin, network_admin, viewer)."
  },
  {
    "version": "1.0.39",
    "date": "2026-02-21",
    "notes": "Access control added — login required. Three roles: admin (full access), network_admin (dashboard + data), viewer (map only). Default credentials admin/password. User management page under System. Each user can change their own password via profile menu."
  },
  {
    "version": "1.0.38",
    "date": "2026-02-21",
    "notes": "Web UI update button on Updates page. Live log modal streams output via SSE. Auto-reconnects after dashboard restart. Error state waits for user dismissal."
  },
  {
    "version": "1.0.37",
    "date": "2026-02-21",
    "notes": "Fixed Aircraft Tracked stat card — now shows 'with position' sub-count. Fixed topbar aircraft count (was showing [object Object])."
  },
  {
    "version": "1.0.36",
    "date": "2026-02-20",
    "notes": "NetBird setup key now persists to .env automatically when enrolled via the VPN page. .env mounted into dashboard container for writing."
  },
  {
    "version": "1.0.35",
    "date": "2026-02-20",
    "notes": "Fixed NetBird enrollment — added /dev/net/tun device to container so WireGuard interface creates successfully."
  },
  {
    "version": "1.0.34",
    "date": "2026-02-20",
    "notes": "NetBird server enrollment UI. VPN page now includes enrollment form — enter a setup key to register the aggregator as a NetBird peer. Status, re-enroll, and disconnect controls added."
  },
  {
    "version": "1.0.33",
    "date": "2026-02-19",
    "notes": "NetBird self-hosted integration. Added nginx config for netbird.tak-solutions.com with TLS (Let's Encrypt). Port 443 added to nginx container with /etc/letsencrypt bind mount."
  },
  {
    "version": "1.0.32",
    "date": "2026-02-18",
    "notes": "Fixed Tailscale feeder classification. Removed is_private gate that excluded CGNAT range (100.64.0.0/10) from VPN detection."
  },
  {
    "version": "1.0.31",
    "date": "2026-02-18",
    "notes": "Fixed Tailscale socket API auth. Added required Sec-Tailscale header to both beast-proxy and dashboard VPN service."
  },
  {
    "version": "1.0.30",
    "date": "2026-02-18",
    "notes": "Beast-proxy fetches aircraft data from tar1090 HTTP instead of non-existent readsb JSON file. Fixes 0 aircraft count. Removed unused readsb-run volume and READSB_JSON_DIR."
  },
  {
    "version": "1.0.29",
    "date": "2026-02-18",
    "notes": "Added READSB_JSON_DIR to enable aircraft.json output. Fixes 0 aircraft count in dashboard and beast-proxy stats."
  },
  {
    "version": "1.0.28",
    "date": "2026-02-18",
    "notes": "Updates page with version check against GitHub, release notes display, and update history log. taknet-agg update now logs to database."
  },
  {
    "version": "1.0.27",
    "date": "2026-02-18",
    "notes": "Feeder names auto-populated from MLAT handshake data, overriding default IP-based naming."
  },
  {
    "version": "1.0.26",
    "date": "2026-02-18",
    "notes": "Web UI now displays feeder coordinates, altitude, and MLAT status. Feeders list shows location and MLAT columns."
  },
  {
    "version": "1.0.25",
    "date": "2026-02-18",
    "notes": "Beast frame parsing for accurate message/position counts. MLAT clients.json integration for coordinates, altitude, and connection status. Added altitude column to schema."
  },
  {
    "version": "1.0.24",
    "date": "2026-02-18",
    "notes": "Beast protocol frame counting, position tracking, MLAT detection via shared log volume. Replaced per-flush counters with real message stats."
  },
  {
    "version": "1.0.23",
    "date": "2026-02-18",
    "notes": "Time-based stats flushing every 30s. Feeders stay active while connected. Aircraft count from readsb. GeoIP enabled by default. Removed stale host mount for mmdb."
  },
  {
    "version": "1.0.22",
    "date": "2026-02-18",
    "notes": "Fixed tar1090 read-only filesystem error. Replaced shared readsb volume with tmpfs mounts for tar1090's internal readsb."
  },
  {
    "version": "1.0.21",
    "date": "2026-02-18",
    "notes": "Fixed mlat-server arguments for wiedehopf fork: --basestation-listen/connect instead of --results."
  },
  {
    "version": "1.0.20",
    "date": "2026-02-18",
    "notes": "Added required --work-dir=/tmp argument for mlat-server."
  },
  {
    "version": "1.0.19",
    "date": "2026-02-18",
    "notes": "Fixed mlat-server Dockerfile — runs script directly from cloned repo instead of pip module. Installs all Python dependencies."
  },
  {
    "version": "1.0.18",
    "date": "2026-02-18",
    "notes": "GeoIP auto-download built into beast-proxy image using db-ip.com City Lite database. No registration required."
  },
  {
    "version": "1.0.17",
    "date": "2026-02-18",
    "notes": "Fixed mlat-server entrypoint from binary to python3 -m. Corrected executable path resolution."
  },
  {
    "version": "1.0.16",
    "date": "2026-02-18",
    "notes": "Healthcheck set to always-pass for readsb container. Resolves dependency startup failures."
  },
  {
    "version": "1.0.15",
    "date": "2026-02-18",
    "notes": "Explicit healthcheck override for readsb. Removed service_healthy dependencies."
  },
  {
    "version": "1.0.14",
    "date": "2026-02-18",
    "notes": "Switched all container dependencies to service_started. Removed custom healthcheck."
  },
  {
    "version": "1.0.13",
    "date": "2026-02-18",
    "notes": "Changed readsb healthcheck from file check to process check. Added start_period grace."
  },
  {
    "version": "1.0.12",
    "date": "2026-02-18",
    "notes": "Fixed mlat-server build: added Cython and build-essential dependencies for C extension compilation."
  },
  {
    "version": "1.0.11",
    "date": "2026-02-18",
    "notes": "Custom mlat-server Dockerfile — builds from wiedehopf/mlat-server source since no published image exists."
  },
  {
    "version": "1.0.10",
    "date": "2026-02-18",
    "notes": "Complete install.sh rewrite. Full validation suite: bash syntax, Python compile, YAML parse, heredoc balance."
  },
  {
    "version": "1.0.9",
    "date": "2026-02-18",
    "notes": "Fixed unquoted SITE_NAME causing bash source error. Safe env variable extraction."
  },
  {
    "version": "1.0.8",
    "date": "2026-02-18",
    "notes": "Renamed .env.example to env.example for macOS Finder/GitHub Desktop visibility."
  },
  {
    "version": "1.0.7",
    "date": "2026-02-18",
    "notes": "Fixed dotfile deployment with shopt dotglob fallback for systems without rsync."
  },
  {
    "version": "1.0.6",
    "date": "2026-02-18",
    "notes": "Added Fresh VPS Setup section to README. Installer bootstraps its own dependencies."
  },
  {
    "version": "1.0.5",
    "date": "2026-02-18",
    "notes": "GitHub curl-pipe installer with auto-clone. Supports both curl-pipe and local clone workflows."
  },
  {
    "version": "1.0.4",
    "date": "2026-02-18",
    "notes": "Removed parallel/cutover mode. WEB_PORT defaults to 80."
  },
  {
    "version": "1.0.3",
    "date": "2026-02-18",
    "notes": "MLAT server wired into Docker stack with client and results ports."
  },
  {
    "version": "1.0.2",
    "date": "2026-02-18",
    "notes": "Port corrections: Beast 30004, MLAT 30105, MLAT results 39001. Tailscale runs on host."
  },
  {
    "version": "1.0.1",
    "date": "2026-02-18",
    "notes": "Detailed README with architecture overview, port map, and deployment instructions."
  },
  {
    "version": "1.0.0",
    "date": "2026-02-18",
    "notes": "Initial Docker-based aggregator build. Six containers: beast-proxy, readsb, mlat-server, tar1090, dashboard, nginx."
  }
]